Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA048.atdf
         <register caption="ADC Common Scan Select Register 1" name="ADCCSS1" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000001" name="CSS0" values="ADCCSS1__CSS0" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000002" name="CSS1" values="ADCCSS1__CSS1" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000004" name="CSS2" values="ADCCSS1__CSS2" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000008" name="CSS3" values="ADCCSS1__CSS3" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000010" name="CSS4" values="ADCCSS1__CSS4" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000020" name="CSS5" values="ADCCSS1__CSS5" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000040" name="CSS6" values="ADCCSS1__CSS6" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000080" name="CSS7" values="ADCCSS1__CSS7" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000100" name="CSS8" values="ADCCSS1__CSS8" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000200" name="CSS9" values="ADCCSS1__CSS9" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000400" name="CSS10" values="ADCCSS1__CSS10" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00000800" name="CSS11" values="ADCCSS1__CSS11" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00001000" name="CSS12" values="ADCCSS1__CSS12" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00002000" name="CSS13" values="ADCCSS1__CSS13" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00004000" name="CSS14" values="ADCCSS1__CSS14" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00008000" name="CSS15" values="ADCCSS1__CSS15" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00010000" name="CSS16" values="ADCCSS1__CSS16" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00020000" name="CSS17" values="ADCCSS1__CSS17" />
         </register>
         <register caption="ADC Common Scan Select Register 2" name="ADCCSS2" offset="0xb0" rw="RW" size="4">
            <bitfield caption="Analog Common Scan Select bits" mask="0x00040000" name="CSS50" values="ADCCSS2__CSS50" />
            <bitfield caption="Analog Common Scan Select bits" mask="0x00200000" name="CSS53" values="ADCCSS2__CSS53" />
         </register>
         <register caption="ADC Data Ready Status Register 1" name="ADCDSTAT1" offset="0xc0" rw="R" size="4">
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000001" name="ARDY0" values="ADCDSTAT1__ARDY0" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000002" name="ARDY1" values="ADCDSTAT1__ARDY1" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000004" name="ARDY2" values="ADCDSTAT1__ARDY2" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000008" name="ARDY3" values="ADCDSTAT1__ARDY3" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000010" name="ARDY4" values="ADCDSTAT1__ARDY4" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000020" name="ARDY5" values="ADCDSTAT1__ARDY5" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000040" name="ARDY6" values="ADCDSTAT1__ARDY6" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000080" name="ARDY7" values="ADCDSTAT1__ARDY7" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000100" name="ARDY8" values="ADCDSTAT1__ARDY8" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000200" name="ARDY9" values="ADCDSTAT1__ARDY9" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000400" name="ARDY10" values="ADCDSTAT1__ARDY10" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00000800" name="ARDY11" values="ADCDSTAT1__ARDY11" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00001000" name="ARDY12" values="ADCDSTAT1__ARDY12" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00002000" name="ARDY13" values="ADCDSTAT1__ARDY13" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00004000" name="ARDY14" values="ADCDSTAT1__ARDY14" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00008000" name="ARDY15" values="ADCDSTAT1__ARDY15" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00010000" name="ARDY16" values="ADCDSTAT1__ARDY16" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00020000" name="ARDY17" values="ADCDSTAT1__ARDY17" />
         </register>
         <register caption="" name="ADCDSTAT2" offset="0xd0" rw="R" size="4">
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00040000" name="ARDY50" values="ADCDSTAT2__ARDY50" />
            <bitfield caption="Conversion Data Ready for Corresponding Analog Input Ready bits" mask="0x00200000" name="ARDY53" values="ADCDSTAT2__ARDY53" />
         </register>
         <register caption="ADC Digital Comparator 'x' Enable Register ('x' = 1 through 4)" name="ADCCMPEN1" offset="0xe0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CMPE0" />
            <bitfield caption="" mask="0x00000002" name="CMPE1" />
            <bitfield caption="" mask="0x00000004" name="CMPE2" />
            <bitfield caption="" mask="0x00000008" name="CMPE3" />
            <bitfield caption="" mask="0x00000010" name="CMPE4" />
            <bitfield caption="" mask="0x00000020" name="CMPE5" />
            <bitfield caption="" mask="0x00000040" name="CMPE6" />
            <bitfield caption="" mask="0x00000080" name="CMPE7" />
            <bitfield caption="" mask="0x00000100" name="CMPE8" />
            <bitfield caption="" mask="0x00000200" name="CMPE9" />
            <bitfield caption="" mask="0x00000400" name="CMPE10" />
            <bitfield caption="" mask="0x00000800" name="CMPE11" />
            <bitfield caption="" mask="0x00001000" name="CMPE12" />
            <bitfield caption="" mask="0x00002000" name="CMPE13" />
            <bitfield caption="" mask="0x00004000" name="CMPE14" />
            <bitfield caption="" mask="0x00008000" name="CMPE15" />
            <bitfield caption="" mask="0x00010000" name="CMPE16" />
            <bitfield caption="" mask="0x00020000" name="CMPE17" />
         </register>
         <register caption="" name="ADCCMP1" offset="0xf0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="DCMPLO" />
            <bitfield caption="" mask="0xFFFF0000" name="DCMPHI" />
         </register>
         <register caption="ADC Digital Comparator 'x' Enable Register ('x' = 1 through 4)" name="ADCCMPEN2" offset="0x100" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CMPE0" />
            <bitfield caption="" mask="0x00000002" name="CMPE1" />
            <bitfield caption="" mask="0x00000004" name="CMPE2" />
            <bitfield caption="" mask="0x00000008" name="CMPE3" />
            <bitfield caption="" mask="0x00000010" name="CMPE4" />
            <bitfield caption="" mask="0x00000020" name="CMPE5" />
            <bitfield caption="" mask="0x00000040" name="CMPE6" />
            <bitfield caption="" mask="0x00000080" name="CMPE7" />
            <bitfield caption="" mask="0x00000100" name="CMPE8" />
            <bitfield caption="" mask="0x00000200" name="CMPE9" />
            <bitfield caption="" mask="0x00000400" name="CMPE10" />
            <bitfield caption="" mask="0x00000800" name="CMPE11" />
            <bitfield caption="" mask="0x00001000" name="CMPE12" />
            <bitfield caption="" mask="0x00002000" name="CMPE13" />
            <bitfield caption="" mask="0x00004000" name="CMPE14" />
            <bitfield caption="" mask="0x00008000" name="CMPE15" />
            <bitfield caption="" mask="0x00010000" name="CMPE16" />
            <bitfield caption="" mask="0x00020000" name="CMPE17" />
         </register>
         <register caption="" name="ADCCMP2" offset="0x110" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="DCMPLO" />
            <bitfield caption="" mask="0xFFFF0000" name="DCMPHI" />
         </register>
         <register caption="ADC Digital Filter Register" name="ADCFLTR1" offset="0x1a0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="FLTRDATA" />
            <bitfield caption="Digital Filter Analog Input Selection bits" mask="0x001F0000" name="CHNLID" values="ADCFLTR1__CHNLID" />
            <bitfield caption="Digital Filter 'x' Data Ready Status bit" mask="0x01000000" name="AFRDY" values="ADCFLTR1__AFRDY" />
            <bitfield caption="Digital Filter 'x' Interrupt Enable bit" mask="0x02000000" name="AFGIEN" values="ADCFLTR1__AFGIEN" />
            <bitfield caption="Oversampling Filter Ratio bits" mask="0x1C000000" name="OVRSAM" values="ADCFLTR1__OVRSAM" />
            <bitfield caption="ADC Filter Mode bit" mask="0x20000000" name="DFMODE" values="ADCFLTR1__DFMODE" />
            <bitfield caption="Filter Significant Data Length bit" mask="0x40000000" name="DATA16EN" values="ADCFLTR1__DATA16EN" />
            <bitfield caption="Digital Filter 'x' Enable bit" mask="0x80000000" name="AFEN" values="ADCFLTR1__AFEN" />
         </register>
         <register caption="ADC Digital Filter Register" name="ADCFLTR2" offset="0x1b0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="FLTRDATA" />
            <bitfield caption="Digital Filter Analog Input Selection bits" mask="0x001F0000" name="CHNLID" values="ADCFLTR2__CHNLID" />
            <bitfield caption="Digital Filter 'x' Data Ready Status bit" mask="0x01000000" name="AFRDY" values="ADCFLTR2__AFRDY" />
            <bitfield caption="Digital Filter 'x' Interrupt Enable bit" mask="0x02000000" name="AFGIEN" values="ADCFLTR2__AFGIEN" />
            <bitfield caption="Oversampling Filter Ratio bits" mask="0x1C000000" name="OVRSAM" values="ADCFLTR2__OVRSAM" />
            <bitfield caption="ADC Filter Mode bit" mask="0x20000000" name="DFMODE" values="ADCFLTR2__DFMODE" />
            <bitfield caption="Filter Significant Data Length bit" mask="0x40000000" name="DATA16EN" values="ADCFLTR2__DATA16EN" />
            <bitfield caption="Digital Filter 'x' Enable bit" mask="0x80000000" name="AFEN" values="ADCFLTR2__AFEN" />
         </register>
         <register caption="ADC Trigger Source 1 Register" name="ADCTRG1" offset="0x200" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of ADC0 Module Select bits" mask="0x0000001F" name="TRGSRC0" values="ADCTRG1__TRGSRC0" />
            <bitfield caption="Trigger Source for Conversion of ADC1 Module Select bits" mask="0x00001F00" name="TRGSRC1" values="ADCTRG1__TRGSRC1" />
            <bitfield caption="Trigger Source for Conversion of ADC2 Module Select bits" mask="0x001F0000" name="TRGSRC2" values="ADCTRG1__TRGSRC2" />
            <bitfield caption="Trigger Source for Conversion of ADC3 Module Select bits" mask="0x1F000000" name="TRGSRC3" values="ADCTRG1__TRGSRC3" />
         </register>
         <register caption="ADC Trigger Source 2 Register" name="ADCTRG2" offset="0x210" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of ADC4 Module Select bits" mask="0x0000001F" name="TRGSRC4" values="ADCTRG2__TRGSRC4" />
            <bitfield caption="Trigger Source for Conversion of ADC5 Module Select bits" mask="0x00001F00" name="TRGSRC5" values="ADCTRG2__TRGSRC5" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN6 Select bits" mask="0x001F0000" name="TRGSRC6" values="ADCTRG2__TRGSRC6" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN7 Select bits" mask="0x1F000000" name="TRGSRC7" values="ADCTRG2__TRGSRC7" />
         </register>
         <register caption="ADC Trigger Source 3 Register" name="ADCTRG3" offset="0x220" rw="RW" size="4">
            <bitfield caption="Trigger Source for Conversion of Analog Input AN8 Select bits" mask="0x0000001F" name="TRGSRC8" values="ADCTRG3__TRGSRC8" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN9 Select bits" mask="0x00001F00" name="TRGSRC9" values="ADCTRG3__TRGSRC9" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN10 Select bits" mask="0x001F0000" name="TRGSRC10" values="ADCTRG3__TRGSRC10" />
            <bitfield caption="Trigger Source for Conversion of Analog Input AN11 Select bits" mask="0x1F000000" name="TRGSRC11" values="ADCTRG3__TRGSRC11" />
         </register>
