Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA048.atdf
         <register caption="Dedicated High-Speed ADCx Timing Register ('x' = 0 through 5)" name="ADC0TIME" offset="0x350" rw="RW" size="4">
            <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC0TIME__SAMC" />
            <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC0TIME__ADCDIV" />
            <bitfield caption="Buffer Channel Enable bit" mask="0x00800000" name="BCHEN" values="ADC0TIME__BCHEN" />
            <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC0TIME__SELRES" />
            <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC0TIME__ADCEIS" />
         </register>
         <register caption="Dedicated High-Speed ADCx Timing Register ('x' = 0 through 5)" name="ADC1TIME" offset="0x360" rw="RW" size="4">
            <bitfield caption="ADCx Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC1TIME__SAMC" />
            <bitfield caption="ADCx Clock Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC1TIME__ADCDIV" />
            <bitfield caption="Buffer Channel Enable bit" mask="0x00800000" name="BCHEN" values="ADC1TIME__BCHEN" />
            <bitfield caption="ADCx Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC1TIME__SELRES" />
            <bitfield caption="ADCx Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC1TIME__ADCEIS" />
         </register>
         <register caption="ADC Early Interrupt Enable Register 1" name="ADCEIEN1" offset="0x3c0" rw="RW" size="4">
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000001" name="EIEN0" values="ADCEIEN1__EIEN0" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000002" name="EIEN1" values="ADCEIEN1__EIEN1" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000004" name="EIEN2" values="ADCEIEN1__EIEN2" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000008" name="EIEN3" values="ADCEIEN1__EIEN3" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000010" name="EIEN4" values="ADCEIEN1__EIEN4" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000020" name="EIEN5" values="ADCEIEN1__EIEN5" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000040" name="EIEN6" values="ADCEIEN1__EIEN6" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000080" name="EIEN7" values="ADCEIEN1__EIEN7" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000100" name="EIEN8" values="ADCEIEN1__EIEN8" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000200" name="EIEN9" values="ADCEIEN1__EIEN9" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000400" name="EIEN10" values="ADCEIEN1__EIEN10" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00000800" name="EIEN11" values="ADCEIEN1__EIEN11" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00001000" name="EIEN12" values="ADCEIEN1__EIEN12" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00002000" name="EIEN13" values="ADCEIEN1__EIEN13" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00004000" name="EIEN14" values="ADCEIEN1__EIEN14" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00008000" name="EIEN15" values="ADCEIEN1__EIEN15" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00010000" name="EIEN16" values="ADCEIEN1__EIEN16" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00020000" name="EIEN17" values="ADCEIEN1__EIEN17" />
         </register>
         <register caption="" name="ADCEIEN2" offset="0x3d0" rw="RW" size="4">
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00040000" name="EIEN50" values="ADCEIEN2__EIEN50" />
            <bitfield caption="Early Interrupt Enable for Analog Input bits" mask="0x00200000" name="EIEN53" values="ADCEIEN2__EIEN53" />
         </register>
         <register caption="ADC Early Interrupt Status Register 1" name="ADCEISTAT1" offset="0x3e0" rw="R" size="4">
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000001" name="EIRDY0" values="ADCEISTAT1__EIRDY0" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000002" name="EIRDY1" values="ADCEISTAT1__EIRDY1" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000004" name="EIRDY2" values="ADCEISTAT1__EIRDY2" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000008" name="EIRDY3" values="ADCEISTAT1__EIRDY3" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000010" name="EIRDY4" values="ADCEISTAT1__EIRDY4" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000020" name="EIRDY5" values="ADCEISTAT1__EIRDY5" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000040" name="EIRDY6" values="ADCEISTAT1__EIRDY6" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000080" name="EIRDY7" values="ADCEISTAT1__EIRDY7" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000100" name="EIRDY8" values="ADCEISTAT1__EIRDY8" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000200" name="EIRDY9" values="ADCEISTAT1__EIRDY9" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000400" name="EIRDY10" values="ADCEISTAT1__EIRDY10" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000800" name="EIRDY11" values="ADCEISTAT1__EIRDY11" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00001000" name="EIRDY12" values="ADCEISTAT1__EIRDY12" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00002000" name="EIRDY13" values="ADCEISTAT1__EIRDY13" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00004000" name="EIRDY14" values="ADCEISTAT1__EIRDY14" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00008000" name="EIRDY15" values="ADCEISTAT1__EIRDY15" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00010000" name="EIRDY16" values="ADCEISTAT1__EIRDY16" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00020000" name="EIRDY17" values="ADCEISTAT1__EIRDY17" />
         </register>
