Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA048.atdf
         <register caption="ADC Early Interrupt Status Register 2" name="ADCEISTAT2" offset="0x3f0" rw="RW" size="4">
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00040000" name="EIRDY50" values="ADCEISTAT2__EIRDY50" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00200000" name="EIRDY53" values="ADCEISTAT2__EIRDY53" />
         </register>
         <register caption="ADC Analog Warm-up Control Register" name="ADCANCON" offset="0x400" rw="RW" size="4">
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000001" name="ANEN0" values="ADCANCON__ANEN0" />
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000002" name="ANEN1" values="ADCANCON__ANEN1" />
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000080" name="ANEN7" values="ADCANCON__ANEN7"/>
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00000100" name="WKRDY0" values="ADCANCON__WKRDY0" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00000200" name="WKRDY1" values="ADCANCON__WKRDY1" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00008000" name="WKRDY7" values="ADCANCON__WKRDY7" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00010000" name="WKIEN0" values="ADCANCON__WKIEN0" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00020000" name="WKIEN1" values="ADCANCON__WKIEN1" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00800000" name="WKIEN7" values="ADCANCON__WKIEN7" />
            <bitfield caption="Wake-up Clock Count bits" mask="0x0F000000" name="WKUPCLKCNT" values="ADCANCON__WKUPCLKCNT" />
         </register>
         <register caption="" name="ADCDATA0" offset="0x600" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA1" offset="0x610" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA2" offset="0x620" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA3" offset="0x630" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA4" offset="0x640" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA5" offset="0x650" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA6" offset="0x660" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA7" offset="0x670" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA8" offset="0x680" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA9" offset="0x690" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA10" offset="0x6a0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA11" offset="0x6b0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA12" offset="0x6c0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA13" offset="0x6d0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA14" offset="0x6e0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA15" offset="0x6f0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA16" offset="0x700" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA17" offset="0x710" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA50" offset="0x920" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADCDATA53" offset="0x950" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="" name="ADC0CFG" offset="0xd00" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="" name="ADC1CFG" offset="0xd10" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="" name="ADC7CFG" offset="0xd70" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
         <register caption="" name="ADCSYSCFG0" offset="0xe00" rw="R" size="4">
            <bitfield caption="" mask="0x00000001" name="AN0" />
            <bitfield caption="" mask="0x00000002" name="AN1" />
            <bitfield caption="" mask="0x00000004" name="AN2" />
            <bitfield caption="" mask="0x00000008" name="AN3" />
            <bitfield caption="" mask="0x00000010" name="AN4" />
            <bitfield caption="" mask="0x00000020" name="AN5" />
            <bitfield caption="" mask="0x00000040" name="AN6" />
            <bitfield caption="" mask="0x00000080" name="AN7" />
            <bitfield caption="" mask="0x00000100" name="AN8" />
            <bitfield caption="" mask="0x00000200" name="AN9" />
            <bitfield caption="" mask="0x00000400" name="AN10" />
            <bitfield caption="" mask="0x00000800" name="AN11" />
            <bitfield caption="" mask="0x00001000" name="AN12" />
            <bitfield caption="" mask="0x00002000" name="AN13" />
            <bitfield caption="" mask="0x00004000" name="AN14" />
            <bitfield caption="" mask="0x00008000" name="AN15" />
            <bitfield caption="" mask="0x00010000" name="AN16" />
            <bitfield caption="" mask="0x00020000" name="AN17" />
         </register>
         <register caption="" name="ADCSYSCFG1" offset="0xe10" rw="R" size="4">
            <bitfield caption="" mask="0x00040000" name="AN50" />
            <bitfield caption="" mask="0x00200000" name="AN53" />
         </register>
      </register-group>
      <value-group caption="DMA to System RAM Buffer Length Size bits" name="ADCCON1__DMABL">
         <value caption="Allocates 128 locations in system memory to each analog input" name="" value="0x7" />
         <value caption="Allocates 64 locations in system memory to each analog input" name="" value="0x6" />
         <value caption="Allocates 32 locations in system memory to each analog input" name="" value="0x5" />
         <value caption="Allocates 16 locations in system memory to each analog input" name="" value="0x4" />
         <value caption="Allocates 8 locations in system memory to each analog input" name="" value="0x3" />
         <value caption="Allocates 4 locations in system memory to each analog input" name="" value="0x2" />
         <value caption="Allocates 2 locations in system memory to each analog input" name="" value="0x1" />
         <value caption="Allocates 1 location in system memory to each analog input" name="" value="0x0" />
      </value-group>
      <value-group caption="Scan Trigger High Level/Positive Edge Sensitivity bit" name="ADCCON1__STRGLVL">
         <value caption="Scan trigger is high level sensitive. Once STRIG mode is selected the scan trigger will continue for all selected analog inputs" name="" value="0x1" />
         <value caption="Scan trigger is positive edge sensitive. Once STRIG mode is selected only a single scan trigger will be generated which will complete the scan of all selected analog inputs. (TRGSRCx in the ADCTRGx register)" name="" value="0x0" />
      </value-group>
