Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA048.atdf
      <value-group caption="Interrupt Vector Shift bits" name="ADCCON1__IRQVS">
         <value caption="Shift x left 7 bit position" name="" value="0x7" />
         <value caption="Shift x left 6 bit position" name="" value="0x6" />
         <value caption="Shift x left 5 bit position" name="" value="0x5" />
         <value caption="Shift x left 4 bit position" name="" value="0x4" />
         <value caption="Shift x left 3 bit position" name="" value="0x3" />
         <value caption="Shift x left 2 bit position" name="" value="0x2" />
         <value caption="Shift x left 1 bit position" name="" value="0x1" />
         <value caption="Shift x left 0 bit position" name="" value="0x0" />
      </value-group>
      <value-group caption="Bypass Fast Synchronous Peripheral Bus Clock to ADC Control Clock" name="ADCCON1__FSPBCLKEN">
         <value caption="Bypass synchronizer logic for peripheral clock to ADC control clocks" name="" value="0x1" />
         <value caption="Enable clock synchronizers for non-synchronized peripheral clock to ADC control clocks" name="" value="0x0" />
      </value-group>
      <value-group caption="Bypass Fast Synchronous DMA System Clock to ADC Control Clock" name="ADCCON1__FSSCLKEN">
         <value caption="Bypass synchronizer logic for DMA system clock to ADC control clocks" name="" value="0x1" />
         <value caption="Enable clock synchronizers for non-synchronized DMA to ADC clock sources" name="" value="0x0" />
      </value-group>
      <value-group caption="Capacitive Voltage Division Enable bit" name="ADCCON1__CVDEN">
         <value caption="CVD operation is enabled" name="" value="0x1" />
         <value caption="CVD operation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Input Charge Pump Enable bit" name="ADCCON1__AICPMPEN">
         <value caption="Analog input charge pump is enabled" name="" value="0x1" />
         <value caption="Analog input charge pump is disabled (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="ADCCON1__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Module Enable bit" name="ADCCON1__ON">
         <value caption="ADC module is enabled" name="" value="0x1" />
         <value caption="ADC module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Scan Trigger Source Select bits" name="ADCCON1__STRGSRC">
         <value caption="PWM Generator 4 Current-Limit" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit" name="" value="0x18" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 period end" name="" value="0x13" />
         <value caption="Output Compare 3 period end" name="" value="0x12" />
         <value caption="Output Compare 2 period end" name="" value="0x11" />
         <value caption="Output Compare 1 period end" name="" value="0x10" />
         <value caption="PWM Generator 4 trigger" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger" name="" value="0xa" />
         <value caption="Secondary PWM time base" name="" value="0x9" />
         <value caption="Primary PWM time base" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC7 Resolution bits" name="ADCCON1__SELRES">
         <value caption="12 bits (default)" name="" value="0x3" />
         <value caption="10 bits" name="" value="0x2" />
         <value caption="8 bits" name="" value="0x1" />
         <value caption="6 bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Fractional Data Output Format bit" name="ADCCON1__FRACT">
         <value caption="Fractional" name="" value="0x1" />
         <value caption="Integer" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Clock Divider bits" name="ADCCON2__ADCDIV">
         <value caption="254 * Tq = Tad" name="" value="0x7f" />
         <value caption="6 * Tq = Tad" name="" value="0x3" />
         <value caption="4 * Tq = Tad" name="" value="0x2" />
         <value caption="2 * Tq = Tad" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Early Interrupt Select bits" name="ADCCON2__ADCEIS">
         <value caption="The data ready interrupt is generated 8 ADC clocks prior to end of conversion" name="" value="0x7" />
         <value caption="The data ready interrupt is generated 7 ADC clocks prior to end of conversion" name="" value="0x6" />
         <value caption="The data ready interrupt is generated 6 ADC clocks prior to end of conversion" name="" value="0x5" />
         <value caption="The data ready interrupt is generated 5 ADC clocks prior to end of conversion" name="" value="0x4" />
         <value caption="The data ready interrupt is generated 4 ADC clocks prior to end of conversion" name="" value="0x3" />
         <value caption="The data ready interrupt is generated 3 ADC clocks prior to end of conversion" name="" value="0x2" />
         <value caption="The data ready interrupt is generated 2 ADC module clocks prior to end of conversion" name="" value="0x1" />
         <value caption="The data ready interrupt is generated 1 ADC module clock prior to end of conversion" name="" value="0x0" />
      </value-group>
