Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA048.atdf
      <value-group caption="Early Interrupt Request Override bit" name="ADCCON2__ADCEIOVR">
         <value caption="Early interrupt generation is overridden and interrupt generation is controlled by the ADCGIRQEN1 and ADCGIRQEN2 registers" name="" value="0x1" />
         <value caption="Early interrupt generation is not overridden and interrupt generation is controlled by the ADCEIEN1 and ADCEIEN2 registers" name="" value="0x0" />
      </value-group>
      <value-group caption="End of Scan Interrupt Enable bit" name="ADCCON2__EOSIEN">
         <value caption="Interrupt will be generated when EOSRDY bit is set" name="" value="0x1" />
         <value caption="No interrupt is generated when the EOSRDY bit is set" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap/ Vref Voltage Fault Interrupt Enable bit" name="ADCCON2__REFFLTIEN">
         <value caption="Interrupt will be generated when the REFFLT bit is set" name="" value="0x1" />
         <value caption="No interrupt is generated when the REFFLT bit is set" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap/ Vref Voltage Ready Interrupt Enable bit" name="ADCCON2__BGVRIEN">
         <value caption="Interrupt will be generated when the BGVRDDY bit is set" name="" value="0x1" />
         <value caption="No interrupt is generated when the BGVRRDY bit is set" name="" value="0x0" />
      </value-group>
      <value-group caption="Sample Time for the Shared ADC (ADC7) bits" name="ADCCON2__SAMC">
         <value caption="1025 Tad" name="" value="0x3ff" />
         <value caption="3 Tad" name="" value="0x1" />
         <value caption="2 Tad" name="" value="0x0" />
      </value-group>
      <value-group caption="End of Scan Interrupt Status bit" name="ADCCON2__EOSRDY">
         <value caption="All analog inputs are considered for scanning through the scan trigger (all analog inputs specified in the ADCCSS1 and ADCCSS2 registers) have completed scanning" name="" value="0x1" />
         <value caption="Scanning has not completed" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap/ Vref / AVdd BOR Fault Status bit" name="ADCCON2__REFFLT">
         <value caption="Fault in band gap or the Vref voltage while the ON bit (ADCCON1) was set. Most likely a band gap or Vref fault will be caused by a BOR of the analog Vdd supply." name="" value="0x1" />
         <value caption="Band gap and Vref voltage are working properly" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap Voltage/ADC Reference Voltage Status bit" name="ADCCON2__BGVRRDY">
         <value caption="Both band gap voltage and ADC reference voltages (Vref) are ready" name="" value="0x1" />
         <value caption="Either or both band gap voltage and ADC reference voltages (Vref) are not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog Input Select bits" name="ADCCON3__ADINSEL">
         <value caption="CTMU Temperature Sensor (internal AN53)" name="" value="0x35" />
         <value caption="IVref 1.2V (internal AN50)" name="" value="0x32" />
         <value caption="AN17" name="" value="0x11" />
         <value caption="AN16" name="" value="0x10" />
         <value caption="AN15" name="" value="0xf" />
         <value caption="AN14" name="" value="0xe" />
         <value caption="AN13" name="" value="0xd" />
         <value caption="AN12" name="" value="0xc" />
         <value caption="AN11" name="" value="0xb" />
         <value caption="AN10" name="" value="0xa" />
         <value caption="AN9" name="" value="0x9" />
         <value caption="AN8" name="" value="0x8" />
         <value caption="AN7" name="" value="0x7" />
         <value caption="AN6" name="" value="0x6" />
         <value caption="AN5" name="" value="0x5" />
         <value caption="AN4" name="" value="0x4" />
         <value caption="AN3" name="" value="0x3" />
         <value caption="AN2" name="" value="0x2" />
         <value caption="AN1" name="" value="0x1" />
         <value caption="AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="Global Software Trigger bit" name="ADCCON3__GSWTRG">
         <value caption="Trigger conversion for ADC inputs that have selected the GSWTRG bit as either through the associated TRGSRC bits in the ADCTRGx registers or through the STRGSRC(4:0) bits in the ADCCON1 register the trigger signal" name="" value="0x1" />
      </value-group>
      <value-group caption="Global Level Software Trigger bit" name="ADCCON3__GLSWTRG">
         <value caption="Trigger conversion for ADC inputs that have selected the GLSWTRG bit as the trigger signal" name="" value="0x1" />
         <value caption="Do not trigger an analog-to-digital conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="Individual ADC Input Conversion Request bit" name="ADCCON3__RQCNVRT">
         <value caption="Trigger the conversion of the selected ADC input as specified by the ADINSEL bits" name="" value="0x1" />
         <value caption="Do not trigger the conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC7 Analog Input Sampling Enable bit " name="ADCCON3__SAMP">
         <value caption="The ADC S&amp;H amplifier is sampling" name="" value="0x1" />
         <value caption="The ADC S&amp;H amplifier is holding" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Update Ready Status bit" name="ADCCON3__UPDRDY">
         <value caption="ADC SFRs can be updated" name="" value="0x1" />
         <value caption="ADC SFRs cannot be updated" name="" value="0x0" />
      </value-group>
      <value-group caption="Update Ready Interrupt Enable bit" name="ADCCON3__UPDIEN">
         <value caption="Interrupt will be generated when the UPDRDY bit is set by hardware" name="" value="0x1" />
         <value caption="No interrupt is generated" name="" value="0x0" />
      </value-group>
