Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA048.atdf
      <value-group caption="Trigger Suspend bit" name="ADCCON3__TRGSUSP">
         <value caption="Triggers are blocked from starting a new analog-to-digital conversion" name="" value="0x1" />
         <value caption="Triggers are not blocked" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Reference Input Selection bits" name="ADCCON3__VREFSEL">
         <value caption="ADC VREFH is VREF+, ADC VREFL is VREF-" name="" value="0x3" />
         <value caption="ADC VREFH is AVDD, ADC VREFL is VREF-" name="" value="0x2" />
         <value caption="ADC VREFH is VREF+, ADC VREFL is AVSS" name="" value="0x1" />
         <value caption="ADC VREFH is AVDD, ADC VREFL is AVSS" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC0 Digital Enable bit" name="ADCCON3__DIGEN0">
         <value caption="ADC0 is digital enabled (required for active operation)" name="" value="0x1" />
         <value caption="ADC0 is digital disabled (power-saving mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC1 Digital Enable bit" name="ADCCON3__DIGEN1">
         <value caption="ADC1 is digital enabled (required for active operation)" name="" value="0x1" />
         <value caption="ADC1 is digital disabled (power-saving mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC2 Digital Enable bit" name="ADCCON3__DIGEN7">
         <value caption="ADC2 is digital enabled (required for active operation)" name="" value="0x1" />
         <value caption="ADC2 is digital disabled (power-saving mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog-to-Digital Control Clock Divider bits" name="ADCCON3__CONCLKDIV">
         <value caption="126 * Tclk = Tq" name="" value="0x3f" />
         <value caption="6 * Tclk = Tq" name="" value="0x3" />
         <value caption="4 * Tclk = Tq" name="" value="0x2" />
         <value caption="2 * Tclk = Tq" name="" value="0x1" />
         <value caption="Tclk = Tq" name="" value="0x0" />
      </value-group>
      <value-group caption="Analog-to-Digital Clock Source bits" name="ADCCON3__ADCSEL">
         <value caption="SYSCLK (Required if using DMA for ADC)" name="" value="0x3" />
         <value caption="REFCLK3" name="" value="0x2" />
         <value caption="FRC" name="" value="0x1" />
         <value caption="SYSCLK" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC0 Synchronous Sampling bit" name="ADCTRGMODE__SSAMPEN0">
         <value caption="ADC0 uses synchronous sampling for the first sample after being idle or disabled" name="" value="0x1" />
         <value caption="ADC0 does not use synchronous sampling" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC1 Synchronous Sampling bit" name="ADCTRGMODE__SSAMPEN1">
         <value caption="ADC1 uses synchronous sampling for the first sample after being idle or disabled" name="" value="0x1" />
         <value caption="ADC1 does not use synchronous sampling" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC0 Presynchronized Triggers bit" name="ADCTRGMODE__STRGEN0">
         <value caption="ADC0 uses presynchronized triggers" name="" value="0x1" />
         <value caption="ADC0 does not use presynchronized triggers" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC1 Presynchronized Triggers bit" name="ADCTRGMODE__STRGEN1">
         <value caption="ADC1 uses presynchronized triggers" name="" value="0x1" />
         <value caption="ADC1 does not use presynchronized triggers" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC0 Analog Input Select bit" name="ADCTRGMODE__SH0ALT">
         <value caption="AN6" name="" value="0x3" />
         <value caption="AN4" name="" value="0x2" />
         <value caption="AN13" name="" value="0x1" />
         <value caption="AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC1 Analog Input Select bit" name="ADCTRGMODE__SH1ALT">
         <value caption="AN16" name="" value="0x3" />
         <value caption="AN5" name="" value="0x2" />
         <value caption="AN3" name="" value="0x1" />
         <value caption="AN1" name="" value="0x0" />
      </value-group>
      <value-group caption="AN0 Signed Data Mode bit" name="ADCIMCON1__SIGN0">
         <value caption="AN0 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN0 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN0 Mode bit" name="ADCIMCON1__DIFF0">
         <value caption="Selects AN0 differential input pair as AN0+ and AN6-" name="" value="0x1" />
         <value caption="AN0 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN1 Signed Data Mode bit" name="ADCIMCON1__SIGN1">
         <value caption="AN1 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN1 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN1 Mode bit" name="ADCIMCON1__DIFF1">
         <value caption="Selects AN1 differential input pair as AN1+ and AN7-" name="" value="0x1" />
         <value caption="AN1 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN2 Signed Data Mode bit" name="ADCIMCON1__SIGN2">
         <value caption="AN2 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN2 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN2 Mode bit" name="ADCIMCON1__DIFF2">
         <value caption="Selects AN2 differential input pair as AN2+ and AN8-" name="" value="0x1" />
         <value caption="AN2 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN3 Signed Data Mode bit" name="ADCIMCON1__SIGN3">
         <value caption="AN3 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN3 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN3 Mode bit" name="ADCIMCON1__DIFF3">
         <value caption="Selects AN3 differential input pair as AN3+ and AN27-" name="" value="0x1" />
         <value caption="AN3 is using Single-ended mode" name="" value="0x0" />
      </value-group>
