Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA048.atdf
      <value-group caption="AN4 Signed Data Mode bit" name="ADCIMCON1__SIGN4">
         <value caption="AN4 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN4 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN4 Mode bit" name="ADCIMCON1__DIFF4">
         <value caption="Selects AN4 differential input pair as AN4+ and AN10-" name="" value="0x1" />
         <value caption="AN4 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN5 Signed Data Mode bit" name="ADCIMCON1__SIGN5">
         <value caption="AN5 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN5 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN5 Mode bit" name="ADCIMCON1__DIFF5">
         <value caption="Selects AN5 differential input pair as AN5+ and AN11-" name="" value="0x1" />
         <value caption="AN5 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN6 Signed Data Mode bit" name="ADCIMCON1__SIGN6">
         <value caption="AN6 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN6 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN6 Mode bit" name="ADCIMCON1__DIFF6">
         <value caption="Selects AN6 differential input pair as AN6+ and AN1-" name="" value="0x1" />
         <value caption="AN6 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN7 Signed Data Mode bit" name="ADCIMCON1__SIGN7">
         <value caption="AN7 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN7 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN7 Mode bit" name="ADCIMCON1__DIFF7">
         <value caption="Selects AN7 differential input pair as AN7+ and AN1-" name="" value="0x1" />
         <value caption="AN7 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN8 Signed Data Mode bit" name="ADCIMCON1__SIGN8">
         <value caption="AN8 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN8 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN 8 Mode bit" name="ADCIMCON1__DIFF8">
         <value caption="Selects AN8 differential input pair as AN8+ and AN1-" name="" value="0x1" />
         <value caption="AN8 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN9 Signed Data Mode bit" name="ADCIMCON1__SIGN9">
         <value caption="AN9 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN9 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN9 Mode bit" name="ADCIMCON1__DIFF9">
         <value caption="Selects AN9 differential input pair as AN9+ and AN1-" name="" value="0x1" />
         <value caption="AN9 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN10 Signed Data Mode bit" name="ADCIMCON1__SIGN10">
         <value caption="AN10 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN10 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN10 Mode bit" name="ADCIMCON1__DIFF10">
         <value caption="Selects AN10 differential input pair as AN10+ and AN1-" name="" value="0x1" />
         <value caption="AN10 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN11 Signed Data Mode bit" name="ADCIMCON1__SIGN11">
         <value caption="AN11 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN11 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN11 Mode bit" name="ADCIMCON1__DIFF11">
         <value caption="Selects AN11 differential input pair as AN11+ and AN1-" name="" value="0x1" />
         <value caption="AN11 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN12 Signed Data Mode bit" name="ADCIMCON1__SIGN12">
         <value caption="AN12 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN12 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN12 Mode bit" name="ADCIMCON1__DIFF12">
         <value caption="Selects AN12 differential input pair as AN12+ and AN1-" name="" value="0x1" />
         <value caption="AN12 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN13 Signed Data Mode bit" name="ADCIMCON1__SIGN13">
         <value caption="AN13 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN13 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN13 Mode bit" name="ADCIMCON1__DIFF13">
         <value caption="Selects AN13 differential input pair as AN13+ and AN1-" name="" value="0x1" />
         <value caption="AN13 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN14 Signed Data Mode bit" name="ADCIMCON1__SIGN14">
         <value caption="AN14 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN14 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN14 Mode bit" name="ADCIMCON1__DIFF14">
         <value caption="Selects AN14 differential input pair as AN14+ and AN1-" name="" value="0x1" />
         <value caption="AN14 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="" name="ADCIMCON1__SIGN15">
         <value caption="AN15 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN15 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN15 Mode bit" name="ADCIMCON1__DIFF15">
         <value caption="Selects AN15 differential input pair as AN15+ and AN1-" name="" value="0x1" />
         <value caption="AN15 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN16 Signed Data Mode bit" name="ADCIMCON2__SIGN16">
         <value caption="AN16 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN16 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN16 Mode bit" name="ADCIMCON2__DIFF16">
         <value caption="Selects AN16 differential pair input as AN16+ and AN1-" name="" value="0x1" />
         <value caption="AN16 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN17 Signed Data Mode bit" name="ADCIMCON2__SIGN17">
         <value caption="AN17 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN17 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN17 Mode bit" name="ADCIMCON2__DIFF17">
         <value caption="Selects AN17 differential pair input as AN17+ and AN1-" name="" value="0x1" />
         <value caption="AN17 is using Single-ended mode" name="" value="0x0" />
      </value-group>
