Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA048.atdf
      <value-group caption="Reference Source Select" name="DAC1CON__REFSEL">
         <value caption="No reference is selected (output is AVSS)" name="" value="0x0" />
         <value caption="Reference voltage is AVDD" name="" value="0x3" />
      </value-group>
      <value-group caption="CDAC Output Enable" name="DAC1CON__DACOE">
         <value caption="Output is Disabled; drive to pin is floating" name="" value="0x0" />
         <value caption="Output is Enabled; CDAC voltage is connected to the pin." name="" value="0x1" />
      </value-group>
      <value-group caption="CDAC Enable" name="DAC1CON__ON">
         <value caption="The CDAC is Disabled" name="" value="0x0" />
         <value caption="The CDAC is Enabled" name="" value="0x1" />
      </value-group>
   </module>
   <module caption="" id="02481" name="CFG" version="">
      <register-group name="CFG">
         <register caption="Configuration Control Register" name="CFGCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="TDO Enable for 2-Wire JTAG" mask="0x00000001" name="TDOEN" values="CFGCON__TDOEN" />
            <bitfield caption="JTAG Port Enable bit" mask="0x00000008" name="JTAGEN" values="CFGCON__JTAGEN" />
            <bitfield caption="Flash ECC Configuration bits" mask="0x00000030" name="ECCCON" values="CFGCON__ECCCON" />
            <bitfield caption="I/O Analog Charge Pump Enable bit" mask="0x00000080" name="IOANCPEN" values="CFGCON__IOANCPEN" />
            <bitfield caption="Permission Group Lock bit" mask="0x00000800" name="PGLOCK" values="CFGCON__PGLOCK" />
            <bitfield caption="Peripheral Module Disable bit" mask="0x00001000" name="PMDLOCK" values="CFGCON__PMDLOCK" />
            <bitfield caption="Peripheral Pin Select Lock bit" mask="0x00002000" name="IOLOCK" values="CFGCON__IOLOCK" />
            <bitfield caption="Output Compare Alternate Clock Selection bit" mask="0x00010000" name="OCACLK" values="CFGCON__OCACLK" />
            <bitfield caption="Input Capture Alternate Clock Selection bit" mask="0x00020000" name="ICACLK" values="CFGCON__ICACLK" />
            <bitfield caption="ADC Arbitration Priority to SRAM bit" mask="0x04000000" name="ADCPRI" values="CFGCON__ADCPRI" />
         </register>
         <register caption="" name="DEVID" offset="0x20" rw="RW" size="4">
            <bitfield caption="" mask="0x0FFFFFFF" name="DEVID" />
            <bitfield caption="" mask="0xF0000000" name="VER" />
         </register>
         <register caption="" name="SYSKEY" offset="0x30" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="SYSKEY" />
         </register>
         <register caption="" name="PMD1" offset="0x40" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ADCMD" />
            <bitfield caption="" mask="0x00000040" name="DAC1MD" />
            <bitfield caption="" mask="0x00000100" name="CTMUMD" />
         </register>
         <register caption="" name="PMD2" offset="0x50" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CMP1MD" />
            <bitfield caption="" mask="0x00000002" name="CMP2MD" />
            <bitfield caption="" mask="0x00000004" name="CMP3MD" />
            <bitfield caption="" mask="0x00010000" name="OPA1MD" />
            <bitfield caption="" mask="0x00020000" name="OPA2MD" />
            <bitfield caption="" mask="0x00040000" name="OPA3MD" />
         </register>
         <register caption="" name="PMD3" offset="0x60" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="IC1MD" />
            <bitfield caption="" mask="0x00000002" name="IC2MD" />
            <bitfield caption="" mask="0x00000004" name="IC3MD" />
            <bitfield caption="" mask="0x00000008" name="IC4MD" />
            <bitfield caption="" mask="0x00010000" name="OC1MD" />
            <bitfield caption="" mask="0x00020000" name="OC2MD" />
            <bitfield caption="" mask="0x00040000" name="OC3MD" />
            <bitfield caption="" mask="0x00080000" name="OC4MD" />
         </register>
         <register caption="" name="PMD4" offset="0x70" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="T1MD" />
            <bitfield caption="" mask="0x00000002" name="T2MD" />
            <bitfield caption="" mask="0x00000004" name="T3MD" />
            <bitfield caption="" mask="0x00000008" name="T4MD" />
            <bitfield caption="" mask="0x00000010" name="T5MD" />
            <bitfield caption="" mask="0x00010000" name="PWM1MD" />
            <bitfield caption="" mask="0x00020000" name="PWM2MD" />
            <bitfield caption="" mask="0x00040000" name="PWM3MD" />
            <bitfield caption="" mask="0x00080000" name="PWM4MD" />
         </register>
         <register caption="" name="PMD5" offset="0x80" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="U1MD" />
            <bitfield caption="" mask="0x00000002" name="U2MD" />
            <bitfield caption="" mask="0x00000100" name="SPI1MD" />
            <bitfield caption="" mask="0x00000200" name="SPI2MD" />
            <bitfield caption="" mask="0x00010000" name="I2C1MD" />
            <bitfield caption="" mask="0x00020000" name="I2C2MD" />
         </register>
         <register caption="" name="PMD6" offset="0x90" rw="RW" size="4">
            <bitfield caption="" mask="0x00000100" name="REFO1MD" />
            <bitfield caption="" mask="0x00000200" name="REFO2MD" />
            <bitfield caption="" mask="0x00000400" name="REFO3MD" />
            <bitfield caption="" mask="0x00000800" name="REFO4MD" />
            <bitfield caption="" mask="0x01000000" name="QEI1MD" />
            <bitfield caption="" mask="0x02000000" name="QEI2MD" />
         </register>
         <register caption="" name="PMD7" offset="0xa0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000010" name="DMAMD" />
         </register>
         <register caption="Permission Group Configuration Register" name="CFGPG" offset="0xe0" rw="RW" size="4">
            <bitfield caption="CPU Instruction Space Permission Group bits" mask="0x00000003" name="CPUPG" values="CFGPG__CPUPG" />
            <bitfield caption="DMA Module Permission Group bits" mask="0x00000030" name="DMAPG" values="CFGPG__DMAPG" />
            <bitfield caption="Flash Control Permission Group bits" mask="0x00C00000" name="FCPG" values="CFGPG__FCPG" />
            <bitfield caption="ADC Permission bits" mask="0x03000000" name="ADCPG" values="CFGPG__ADCPG" />
         </register>
      </register-group>
      <value-group caption="TDO Enable for 2-Wire JTAG" name="CFGCON__TDOEN">
         <value caption="2-wire JTAG protocol uses TDO" name="" value="0x1" />
         <value caption="2-wire JTAG protocol does not use TDO" name="" value="0x0" />
      </value-group>
      <value-group caption="JTAG Port Enable bit" name="CFGCON__JTAGEN">
         <value caption="Enable the JTAG port" name="" value="0x1" />
         <value caption="Disable the JTAG port" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash ECC Configuration bits" name="CFGCON__ECCCON">
         <value caption="ECC and dynamic ECC are disabled (ECCCON bits are writable)" name="" value="0x3" />
         <value caption="ECC and dynamic ECC are disabled (ECCCON bits are locked)" name="" value="0x2" />
         <value caption="Dynamic Flash ECC is enabled (ECCCON bits are locked)" name="" value="0x1" />
         <value caption="Flash ECC is enabled (ECCCON bits are locked; disables word Flash writes)" name="" value="0x0" />
      </value-group>
