Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA048.atdf
      <value-group caption="Peripheral Bus x Clock Divisor Ready bit" name="PB1DIV__PBDIVRDY">
         <value caption="Clock divisor logic is not switching divisors and the PBxDIV bits may be written" name="" value="0x1" />
         <value caption="Clock divisor logic is currently switching values and the PBxDIV bits cannot be written" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Output Clock Enable bit" name="PB1DIV__ON">
         <value caption="Output clock is enabled" name="" value="0x1" />
         <value caption="Output clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Control bits" name="PB2DIV__PBDIV">
         <value caption="PBCLKx is SYSCLK divided by 128" name="" value="0x7f" />
         <value caption="PBCLKx is SYSCLK divided by 127" name="" value="0x7e" />
         <value caption="PBCLKx is SYSCLK divided by 4 (default value for x = 6)" name="" value="0x3" />
         <value caption="PBCLKx is SYSCLK divided by 3" name="" value="0x2" />
         <value caption="PBCLKx is SYSCLK divided by 2 (default value for x less than 6)" name="" value="0x1" />
         <value caption="PBCLKx is SYSCLK divided by 1 (default value for x = 7)" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Ready bit" name="PB2DIV__PBDIVRDY">
         <value caption="Clock divisor logic is not switching divisors and the PBxDIV bits may be written" name="" value="0x1" />
         <value caption="Clock divisor logic is currently switching values and the PBxDIV bits cannot be written" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Output Clock Enable bit" name="PB2DIV__ON">
         <value caption="Output clock is enabled" name="" value="0x1" />
         <value caption="Output clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Control bits" name="PB4DIV__PBDIV">
         <value caption="PBCLKx is SYSCLK divided by 128" name="" value="0x7f" />
         <value caption="PBCLKx is SYSCLK divided by 127" name="" value="0x7e" />
         <value caption="PBCLKx is SYSCLK divided by 4 (default value for x = 6)" name="" value="0x3" />
         <value caption="PBCLKx is SYSCLK divided by 3" name="" value="0x2" />
         <value caption="PBCLKx is SYSCLK divided by 2 (default value for x less than 6)" name="" value="0x1" />
         <value caption="PBCLKx is SYSCLK divided by 1 (default value for x = 7)" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Ready bit" name="PB4DIV__PBDIVRDY">
         <value caption="Clock divisor logic is not switching divisors and the PBxDIV bits may be written" name="" value="0x1" />
         <value caption="Clock divisor logic is currently switching values and the PBxDIV bits cannot be written" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Output Clock Enable bit" name="PB4DIV__ON">
         <value caption="Output clock is enabled" name="" value="0x1" />
         <value caption="Output clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Control bits" name="PB6DIV__PBDIV">
         <value caption="PBCLKx is SYSCLK divided by 128" name="" value="0x7f" />
         <value caption="PBCLKx is SYSCLK divided by 127" name="" value="0x7e" />
         <value caption="PBCLKx is SYSCLK divided by 4 (default value for x = 6)" name="" value="0x3" />
         <value caption="PBCLKx is SYSCLK divided by 3" name="" value="0x2" />
         <value caption="PBCLKx is SYSCLK divided by 2 (default value for x less than 6)" name="" value="0x1" />
         <value caption="PBCLKx is SYSCLK divided by 1 (default value for x = 7)" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Clock Divisor Ready bit" name="PB6DIV__PBDIVRDY">
         <value caption="Clock divisor logic is not switching divisors and the PBxDIV bits may be written" name="" value="0x1" />
         <value caption="Clock divisor logic is currently switching values and the PBxDIV bits cannot be written" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus x Output Clock Enable bit" name="PB6DIV__ON">
         <value caption="Output clock is enabled" name="" value="0x1" />
         <value caption="Output clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Switching Slewing Active Status bit" name="SLEWCON__BUSY">
         <value caption="Clock frequency is being actively slewed to the new frequency" name="" value="0x1" />
         <value caption="Clock switch has reached its final value" name="" value="0x0" />
      </value-group>
      <value-group caption="Downward Slew Enable bit" name="SLEWCON__DNEN">
         <value caption="Slewing enabled for switching to a lower frequency" name="" value="0x1" />
         <value caption="Slewing disabled for switching to a lower frequency" name="" value="0x0" />
      </value-group>
      <value-group caption="Upward Slew Enable bit" name="SLEWCON__UPEN">
         <value caption="Slewing enabled for switching to a higher frequency" name="" value="0x1" />
         <value caption="Slewing disabled for switching to a higher frequency" name="" value="0x0" />
      </value-group>
      <value-group caption="Slew Divisor Steps Control bits" name="SLEWCON__SLWDIV">
         <value caption="Steps are divide by 128, 64, 32, 16, 8, 4, 2, and then no divisor" name="" value="0x7" />
         <value caption="Steps are divide by 64, 32, 16, 8, 4, 2, and then no divisor" name="" value="0x6" />
         <value caption="Steps are divide by 32, 16, 8, 4, 2, and then no divisor" name="" value="0x5" />
         <value caption="Steps are divide by 16, 8, 4, 2, and then no divisor" name="" value="0x4" />
         <value caption="Steps are divide by 8, 4, 2, and then no divisor" name="" value="0x3" />
         <value caption="Steps are divide by 4, 2, and then no divisor" name="" value="0x2" />
         <value caption="Steps are divide by 2, and then no divisor" name="" value="0x1" />
         <value caption="No divisor is used during slewing" name="" value="0x0" />
      </value-group>
      <value-group caption="System Clock Divide Control bits" name="SLEWCON__SYSDIV">
         <value caption="SYSCLK is divided by 16" name="" value="0xf" />
         <value caption="SYSCLK is divided by 15" name="" value="0xe" />
         <value caption="SYSCLK is divided by 14" name="" value="0xd" />
         <value caption="SYSCLK is divided by 13" name="" value="0xc" />
         <value caption="SYSCLK is divided by 12" name="" value="0xb" />
         <value caption="SYSCLK is divided by 11" name="" value="0xa" />
         <value caption="SYSCLK is divided by 10" name="" value="0x9" />
         <value caption="SYSCLK is divided by 9" name="" value="0x8" />
         <value caption="SYSCLK is divided by 8" name="" value="0x7" />
         <value caption="SYSCLK is divided by 7" name="" value="0x6" />
         <value caption="SYSCLK is divided by 6" name="" value="0x5" />
         <value caption="SYSCLK is divided by 5" name="" value="0x4" />
         <value caption="SYSCLK is divided by 4" name="" value="0x3" />
         <value caption="SYSCLK is divided by 3" name="" value="0x2" />
         <value caption="SYSCLK is divided by 2" name="" value="0x1" />
         <value caption="SYSCLK is not divided" name="" value="0x0" />
      </value-group>
      <value-group caption="Fast RC Oscillator Ready Status bit" name="CLKSTAT__FRCRDY">
         <value caption="FRC is stable and ready" name="" value="0x1" />
         <value caption="FRC is disabled for not operating" name="" value="0x0" />
      </value-group>
