Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA048.atdf
         <register caption="" name="OFF033" offset="0x5c4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF035" offset="0x5cc" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF036" offset="0x5d0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF037" offset="0x5d4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF038" offset="0x5d8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF039" offset="0x5dc" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF040" offset="0x5e0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF041" offset="0x5e4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF042" offset="0x5e8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF043" offset="0x5ec" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF044" offset="0x5f0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF045" offset="0x5f4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF046" offset="0x5f8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF047" offset="0x5fc" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF053" offset="0x614" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF054" offset="0x618" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF055" offset="0x61c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF056" offset="0x620" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF057" offset="0x624" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF058" offset="0x628" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF059" offset="0x62c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF060" offset="0x630" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF061" offset="0x634" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF071" offset="0x65c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF072" offset="0x660" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF073" offset="0x664" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF074" offset="0x668" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF075" offset="0x66c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF092" offset="0x6b0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF094" offset="0x6b8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF095" offset="0x6bc" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF096" offset="0x6c0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF097" offset="0x6c4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF100" offset="0x6d0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF101" offset="0x6d4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF102" offset="0x6d8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF103" offset="0x6dc" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF104" offset="0x6e0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
