Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA048.atdf
         <register caption="" name="OFF105" offset="0x6e4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF106" offset="0x6e8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF107" offset="0x6ec" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF108" offset="0x6f0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF109" offset="0x6f4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF110" offset="0x6f8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF111" offset="0x6fc" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF112" offset="0x700" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF113" offset="0x704" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF114" offset="0x708" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF115" offset="0x70c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF116" offset="0x710" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF117" offset="0x714" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF118" offset="0x718" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF119" offset="0x71c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF120" offset="0x720" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF121" offset="0x724" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF122" offset="0x728" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF123" offset="0x72c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF156" offset="0x7b0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF159" offset="0x7bc" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF160" offset="0x7c0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF169" offset="0x7e4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF170" offset="0x7e8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF171" offset="0x7ec" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF172" offset="0x7f0" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF173" offset="0x7f4" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF174" offset="0x7f8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF175" offset="0x7fc" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF176" offset="0x800" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF182" offset="0x818" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF183" offset="0x81c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF184" offset="0x820" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF185" offset="0x824" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF230" offset="0x8d8" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF247" offset="0x91c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF249" offset="0x924" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF254" offset="0x938" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF255" offset="0x93c" rw="RW" size="4">
            <bitfield caption="" mask="0x0003FFFE" name="VOFF" />
         </register>
      </register-group>
      <value-group caption="External Interrupt 0 Edge" name="INTCON__INT0EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 1 Edge" name="INTCON__INT1EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 2 Edge" name="INTCON__INT2EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 3 Edge" name="INTCON__INT3EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 4 Edge" name="INTCON__INT4EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
