Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA048.atdf
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON4" offset="0x3d0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON4__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON4__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield mask="0x000000C0" name="OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON4__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON4__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON4__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON4__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON4__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON4__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON4__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON4__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON4__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON4__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON4__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON4__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON4__CLSRC" />
         </register>
         <register caption="" name="PDC1" offset="0xe0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="" name="PDC2" offset="0x1e0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="" name="PDC3" offset="0x2e0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="" name="PDC4" offset="0x3e0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PDC" />
         </register>
         <register caption="" name="SDC1" offset="0xf0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="" name="SDC2" offset="0x1f0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="" name="SDC3" offset="0x2f0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="" name="SDC4" offset="0x3f0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="SDC" />
         </register>
         <register caption="" name="PHASE1" offset="0x100" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="" name="PHASE2" offset="0x200" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="" name="PHASE3" offset="0x300" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="" name="PHASE4" offset="0x400" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PHASE" />
         </register>
         <register caption="" name="DTR1" offset="0x110" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="" name="DTR2" offset="0x210" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="" name="DTR3" offset="0x310" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="" name="DTR4" offset="0x410" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="DTR" />
         </register>
         <register caption="" name="ALTDTR1" offset="0x120" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="" name="ALTDTR2" offset="0x220" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="" name="ALTDTR3" offset="0x320" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="" name="ALTDTR4" offset="0x420" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="ALTDTR" />
         </register>
         <register caption="" name="DTCOMP1" offset="0x130" rw="RW" size="4">
            <bitfield caption="" mask="0x00003FFF" name="COMP" />
         </register>
         <register caption="" name="DTCOMP2" offset="0x230" rw="RW" size="4">
            <bitfield caption="" mask="0x00003FFF" name="COMP" />
         </register>
         <register caption="" name="DTCOMP3" offset="0x330" rw="RW" size="4">
            <bitfield caption="" mask="0x00003FFF" name="COMP" />
         </register>
         <register caption="" name="DTCOMP4" offset="0x430" rw="RW" size="4">
            <bitfield caption="" mask="0x00003FFF" name="COMP" />
         </register>
         <register caption="" name="TRIG1" offset="0x140" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TRGCMP" />
         </register>
         <register caption="" name="TRIG2" offset="0x240" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TRGCMP" />
         </register>
         <register caption="" name="TRIG3" offset="0x340" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TRGCMP" />
         </register>
         <register caption="" name="TRIG4" offset="0x440" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TRGCMP" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON1" offset="0x150" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON1__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON1__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON1__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON1__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON1__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON2" offset="0x250" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON2__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON2__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON2__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON2__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON2__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON3" offset="0x350" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON3__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON3__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON3__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON3__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON3__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON4" offset="0x450" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON4__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON4__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON4__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON4__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON4__TRGDIV" />
         </register>
         <register caption="" name="STRIG1" offset="0x160" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="" name="STRIG2" offset="0x260" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="" name="STRIG3" offset="0x360" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="" name="STRIG4" offset="0x460" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="" name="CAP1" offset="0x170" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CAP" />
         </register>
