Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA048.atdf
         <register caption="" name="POS1CNT" offset="0x30" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="POSCNT" />
         </register>
         <register caption="" name="POS2CNT" offset="0x230" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="POSCNT" />
         </register>
         <register caption="" name="POS1HLD" offset="0x40" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="POSHLD" />
         </register>
         <register caption="" name="POS2HLD" offset="0x240" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="POSHLD" />
         </register>
         <register caption="" name="VEL1CNT" offset="0x50" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="VELCNT" />
         </register>
         <register caption="" name="VEL2CNT" offset="0x250" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="VELCNT" />
         </register>
         <register caption="" name="VEL1HLD" offset="0x60" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="VELHLD" />
         </register>
         <register caption="" name="VEL2HLD" offset="0x260" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="VELHLD" />
         </register>
         <register caption="" name="INT1TMR" offset="0x70" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="INTTMR" />
         </register>
         <register caption="" name="INT2TMR" offset="0x270" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="INTTMR" />
         </register>
         <register caption="" name="INT1HLD" offset="0x80" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="INTHLD" />
         </register>
         <register caption="" name="INT2HLD" offset="0x280" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="INTHLD" />
         </register>
         <register caption="" name="INDX1CNT" offset="0x90" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="INDXCNT" />
         </register>
         <register caption="" name="INDX2CNT" offset="0x290" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="INDXCNT" />
         </register>
         <register caption="" name="INDX1HLD" offset="0xa0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="INDXHLD" />
         </register>
         <register caption="" name="INDX2HLD" offset="0x2a0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="INDXHLD" />
         </register>
         <register caption="QEIx Initialize/Capture/Compare Register" name="QEI1ICC" offset="0xb0" rw="RW" size="4">
            <bitfield caption="32-bit Initialize/Capture/Compare High bits" mask="0xFFFFFFFF" name="QEIICC" value="QEI1ICC__QEIICC" />
         </register>
         <register caption="QEIx Initialize/Capture/Compare Register" name="QEI2ICC" offset="0x2b0" rw="RW" size="4">
            <bitfield caption="32-bit Initialize/Capture/Compare High bits" mask="0xFFFFFFFF" name="QEIICC" value="QEI2ICC__QEIICC" />
         </register>
         <register caption="Capture Low Register" name="QEI1CMPL" offset="0xc0" rw="RW" size="4">
            <bitfield caption="32-bit Compare Low Value bits" mask="0xFFFFFFFF" name="QEICMPL" value="QEI1CMPL__QEICMPL" />
         </register>
         <register caption="Capture Low Register" name="QEI2CMPL" offset="0x2c0" rw="RW" size="4">
            <bitfield caption="32-bit Compare Low Value bits" mask="0xFFFFFFFF" name="QEICMPL" value="QEI2CMPL__QEICMPL" />
         </register>
      </register-group>
      <value-group caption="Counter Control Mode Selection bits" name="QEI1CON__CCM">
         <value caption="Internal Timer mode with optional QEB external clock gating input control based on GATEN. QEB High is Timer Run" name="" value="0x3" />
         <value caption="QEA is the external clock input QEB is optional clock gating input control based on GATEN. QEB High is Clock Run, QEB Low is Clock Stop." name="" value="0x2" />
         <value caption="QEA is the external clock input QEB is external UP/DN direction input. (QEB High is Count Up, QEB Low is Count Down)" name="" value="0x1" />
         <value caption="Quadrature Encoder Interface Count mode (x4 mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="External Count Gate Enable bit" name="QEI1CON__GATEN">
         <value caption="External gate signal controls position counter operation" name="" value="0x1" />
         <value caption="External gate signal does not affect position counter/timer operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Position and Index Counter/Timer Direction Select bit" name="QEI1CON__CNTPOL">
         <value caption="Counter direction is negative unless modified by external Up/Down signal" name="" value="0x1" />
         <value caption="Counter direction is positive unless modified by external Up/Down signal" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits " name="QEI1CON__INTDIV">
         <value caption="1:128 prescale value" name="" value="0x7" />
         <value caption="1:64 prescale value" name="" value="0x6" />
         <value caption="1:32 prescale value" name="" value="0x5" />
         <value caption="1:16 prescale value" name="" value="0x4" />
         <value caption="1:8 prescale value" name="" value="0x3" />
         <value caption="1:4 prescale value" name="" value="0x2" />
         <value caption="1:2 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
      <value-group caption="Index Match Value bits" name="QEI1CON__IMV">
         <value caption="Index match occurs when QEB is 1 and QEA is 1" name="" value="0x3" />
         <value caption="Index match occurs when QEB is 1 and QEA is 0" name="" value="0x2" />
         <value caption="Index match occurs when QEB is 0 and QEA is 1" name="" value="0x1" />
         <value caption="Index match occurs when QEB is 0 and QEA is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Initialization Mode Select bits" name="QEI1CON__PIMOD">
         <value caption="Modulo Count mode for position counter and every index event resets the position counter" name="" value="0x7" />
         <value caption="Modulo Count mode for position counter" name="" value="0x6" />
         <value caption="Resets the position counter when the position counter equals QEIxICCH register" name="" value="0x5" />
         <value caption="Second index event after home event initializes position counter with contents of QEIxICCHregister" name="" value="0x4" />
         <value caption="First index event after home event initializes position counter with contents of QEIxICCH register" name="" value="0x3" />
         <value caption="Next index input event initializes the position counter with contents of QEIxICCH register" name="" value="0x2" />
         <value caption="Every Index input event resets the position counter" name="" value="0x1" />
         <value caption="Index input event does not affect position counter" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="QEI1CON__QEISIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Quadrature Encoder Interface Module Counter Enable bit" name="QEI1CON__QEIEN">
         <value caption="Module counters are enabled" name="" value="0x1" />
         <value caption="Module counters are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Counter Control Mode Selection bits" name="QEI2CON__CCM">
         <value caption="Internal Timer mode with optional QEB external clock gating input control based on GATEN. QEB High is Timer Run" name="" value="0x3" />
         <value caption="QEA is the external clock input QEB is optional clock gating input control based on GATEN. QEB High is Clock Run, QEB Low is Clock Stop." name="" value="0x2" />
         <value caption="QEA is the external clock input QEB is external UP/DN direction input. (QEB High is Count Up, QEB Low is Count Down)" name="" value="0x1" />
         <value caption="Quadrature Encoder Interface Count mode (x4 mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="External Count Gate Enable bit" name="QEI2CON__GATEN">
         <value caption="External gate signal controls position counter operation" name="" value="0x1" />
         <value caption="External gate signal does not affect position counter/timer operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Position and Index Counter/Timer Direction Select bit" name="QEI2CON__CNTPOL">
         <value caption="Counter direction is negative unless modified by external Up/Down signal" name="" value="0x1" />
         <value caption="Counter direction is positive unless modified by external Up/Down signal" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits " name="QEI2CON__INTDIV">
         <value caption="1:128 prescale value" name="" value="0x7" />
         <value caption="1:64 prescale value" name="" value="0x6" />
         <value caption="1:32 prescale value" name="" value="0x5" />
         <value caption="1:16 prescale value" name="" value="0x4" />
         <value caption="1:8 prescale value" name="" value="0x3" />
         <value caption="1:4 prescale value" name="" value="0x2" />
         <value caption="1:2 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
      <value-group caption="Index Match Value bits" name="QEI2CON__IMV">
         <value caption="Index match occurs when QEB is 1 and QEA is 1" name="" value="0x3" />
         <value caption="Index match occurs when QEB is 1 and QEA is 0" name="" value="0x2" />
         <value caption="Index match occurs when QEB is 0 and QEA is 1" name="" value="0x1" />
         <value caption="Index match occurs when QEB is 0 and QEA is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Initialization Mode Select bits" name="QEI2CON__PIMOD">
         <value caption="Modulo Count mode for position counter and every index event resets the position counter" name="" value="0x7" />
         <value caption="Modulo Count mode for position counter" name="" value="0x6" />
         <value caption="Resets the position counter when the position counter equals QEIxICCH register" name="" value="0x5" />
         <value caption="Second index event after home event initializes position counter with contents of QEIxICCHregister" name="" value="0x4" />
         <value caption="First index event after home event initializes position counter with contents of QEIxICCH register" name="" value="0x3" />
         <value caption="Next index input event initializes the position counter with contents of QEIxICCH register" name="" value="0x2" />
         <value caption="Every Index input event resets the position counter" name="" value="0x1" />
         <value caption="Index input event does not affect position counter" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="QEI2CON__QEISIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
