Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA048.atdf
         <register caption="" name="FLT2R" offset="0xf0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="FLT2R" />
         </register>
         <register caption="" name="CLCINAR" offset="0x170" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="CLCINAR" />
         </register>
         <register caption="" name="CLCINBR" offset="0x174" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="CLCINBR" />
         </register>
         <register caption="" name="CLCINCR" offset="0x178" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="CLCINCR" />
         </register>
         <register caption="" name="CLCINDR" offset="0x17c" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="CLCINDR" />
         </register>
      </register-group>
   </module>
   <module caption="" id="02481" name="RPOR" version="">
      <register-group name="RPOR">
         <register caption="" name="RPA0R" offset="0x0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPA0R" />
         </register>
         <register caption="" name="RPA1R" offset="0x4" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPA1R" />
         </register>
         <register caption="" name="RPA2R" offset="0x8" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPA2R" />
         </register>
         <register caption="" name="RPA3R" offset="0xc" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPA3R" />
         </register>
         <register caption="" name="RPA4R" offset="0x10" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPA4R" />
         </register>
         <register caption="" name="RPA7R" offset="0x1c" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPA7R" />
         </register>
         <register caption="" name="RPA8R" offset="0x20" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPA8R" />
         </register>
         <register caption="" name="RPA11R" offset="0x2c" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPA11R" />
         </register>
         <register caption="" name="RPA12R" offset="0x30" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPA12R" />
         </register>
         <register caption="" name="RPB0R" offset="0x40" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPB0R" />
         </register>
         <register caption="" name="RPB1R" offset="0x44" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPB1R" />
         </register>
         <register caption="" name="RPB2R" offset="0x48" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPB2R" />
         </register>
         <register caption="" name="RPB3R" offset="0x4c" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPB3R" />
         </register>
         <register caption="" name="RPB4R" offset="0x50" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPB4R" />
         </register>
         <register caption="" name="RPB5R" offset="0x54" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPB5R" />
         </register>
         <register caption="" name="RPB6R" offset="0x58" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPB6R" />
         </register>
         <register caption="" name="RPB7R" offset="0x5c" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPB7R" />
         </register>
         <register caption="" name="RPB9R" offset="0x64" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPB9R" />
         </register>
         <register caption="" name="RPB10R" offset="0x68" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPB10R" />
         </register>
         <register caption="" name="RPB11R" offset="0x6c" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPB11R" />
         </register>
         <register caption="" name="RPB12R" offset="0x70" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPB12R" />
         </register>
         <register caption="" name="RPB13R" offset="0x74" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPB13R" />
         </register>
         <register caption="" name="RPB14R" offset="0x78" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPB14R" />
         </register>
         <register caption="" name="RPB15R" offset="0x7c" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPB15R" />
         </register>
         <register caption="" name="RPC0R" offset="0x80" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPC0R" />
         </register>
         <register caption="" name="RPC1R" offset="0x84" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPC1R" />
         </register>
         <register caption="" name="RPC2R" offset="0x88" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPC2R" />
         </register>
         <register caption="" name="RPC6R" offset="0x98" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPC6R" />
         </register>
         <register caption="" name="RPC7R" offset="0x9c" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPC7R" />
         </register>
         <register caption="" name="RPC8R" offset="0xa0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPC8R" />
         </register>
         <register caption="" name="RPC9R" offset="0xa4" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPC9R" />
         </register>
         <register caption="" name="RPC10R" offset="0xa8" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPC10R" />
         </register>
         <register caption="" name="RPC12R" offset="0xb0" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RPC12R" />
         </register>
