Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.11.151/atdf/PIC32MK0128MCA048.atdf
         <register caption="" name="SBT2RD2" offset="0x8380" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT2RD2__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT2RD2__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT2RD2__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT2RD2__GROUP3" />
         </register>
         <register caption="" name="SBT3RD0" offset="0x8740" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT3RD0__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT3RD0__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT3RD0__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT3RD0__GROUP3" />
         </register>
         <register caption="" name="SBT3RD1" offset="0x8760" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT3RD1__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT3RD1__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT3RD1__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT3RD1__GROUP3" />
         </register>
         <register caption="" name="SBT3RD2" offset="0x8780" rw="RW" size="4">
            <bitfield caption="Group0 Read Permissions bits" mask="0x00000001" name="GROUP0" values="SBT3RD2__GROUP0" />
            <bitfield caption="Group1 Read Permissions bits" mask="0x00000002" name="GROUP1" values="SBT3RD2__GROUP1" />
            <bitfield caption="Group2 Read Permissions bits" mask="0x00000004" name="GROUP2" values="SBT3RD2__GROUP2" />
            <bitfield caption="Group3 Read Permissions bits" mask="0x00000008" name="GROUP3" values="SBT3RD2__GROUP3" />
         </register>
         <register caption="" name="SBT0WR0" offset="0x7b48" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT0WR0__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT0WR0__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT0WR0__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT0WR0__GROUP3" />
         </register>
         <register caption="" name="SBT0WR1" offset="0x7b68" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT0WR1__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT0WR1__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT0WR1__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT0WR1__GROUP3" />
         </register>
         <register caption="" name="SBT1WR0" offset="0x7f48" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1WR0__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1WR0__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1WR0__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1WR0__GROUP3" />
         </register>
         <register caption="" name="SBT1WR2" offset="0x7f88" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1WR2__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1WR2__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1WR2__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1WR2__GROUP3" />
         </register>
         <register caption="" name="SBT1WR3" offset="0x7fa8" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1WR3__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1WR3__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1WR3__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1WR3__GROUP3" />
         </register>
         <register caption="" name="SBT1WR4" offset="0x7fc8" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1WR4__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1WR4__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1WR4__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1WR4__GROUP3" />
         </register>
         <register caption="" name="SBT1WR5" offset="0x7fe8" rw="RW" size="4">
            <bitfield caption="Group 0 Write Permissions bits" mask="0x00000001" name="GROUP0" values="SBT1WR5__GROUP0" />
            <bitfield caption="Group 1 Write Permissions bits" mask="0x00000002" name="GROUP1" values="SBT1WR5__GROUP1" />
            <bitfield caption="Group 2 Write Permissions bits" mask="0x00000004" name="GROUP2" values="SBT1WR5__GROUP2" />
            <bitfield caption="Group 3 Write Permissions bits" mask="0x00000008" name="GROUP3" values="SBT1WR5__GROUP3" />
         </register>
